# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'imagemagick'
brew 'nginx'
brew 'dnsmasq'
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'python'
brew 'maven'
brew 'docker-credential-helper'
brew 'starship'
brew 'fig'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'svn'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjdk@8'
brew 'pyenv'

# Apps
cask 'hyper'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'intellij-idea'
cask 'visual-studio-code'
cask 'zoom'
cask 'viscosity'
cask 'sourcetree'
cask 'drovio'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-jetbrains-mono'

